{
  "lastUpdated": "2026-01-17T10:12:54.955Z",
  "videos": [
    {
      "title": "From Losing My Phone to Seeing a Celebrity | F1 Student's first Ski Trip",
      "link": "https://www.youtube.com/watch?v=uMlc6GwK3EU",
      "date": "Jan 15, 2026",
      "thumbnail": "https://i.ytimg.com/vi/uMlc6GwK3EU/hqdefault.jpg",
      "views": "Watch on YouTube"
    },
    {
      "title": "Chicago Boat Ride 😌",
      "link": "https://www.youtube.com/shorts/orMsiM0t39M",
      "date": "Sep 3, 2025",
      "thumbnail": "https://i.ytimg.com/vi/orMsiM0t39M/hqdefault.jpg",
      "views": "Watch on YouTube"
    },
    {
      "title": "Aesthetic Travel Vibes: Short Trip Edition ✈️✨#travelaesthetic #travelvlog #travel #wanderlust",
      "link": "https://www.youtube.com/shorts/rOJ3HsV4KC0",
      "date": "Jan 6, 2025",
      "thumbnail": "https://i.ytimg.com/vi/rOJ3HsV4KC0/hqdefault.jpg",
      "views": "Watch on YouTube"
    },
    {
      "title": "Chicago Thanksgiving Parade 2024 | Highlights from My Amazing Trip!",
      "link": "https://www.youtube.com/watch?v=pWhyuQ-X9M8",
      "date": "Dec 5, 2024",
      "thumbnail": "https://i.ytimg.com/vi/pWhyuQ-X9M8/hqdefault.jpg",
      "views": "Watch on YouTube"
    },
    {
      "title": "🎥 Chicago Concert Vlog | Ayushmann Khurrana Live Experience 🇮🇳🎶",
      "link": "https://www.youtube.com/watch?v=gU6TfnBo5bM",
      "date": "Nov 26, 2024",
      "thumbnail": "https://i.ytimg.com/vi/gU6TfnBo5bM/hqdefault.jpg",
      "views": "Watch on YouTube"
    },
    {
      "title": "Pehla Intro (Will improve as I learn more 😉)",
      "link": "https://www.youtube.com/watch?v=P4vpeoBWm4s",
      "date": "Oct 1, 2024",
      "thumbnail": "https://i.ytimg.com/vi/P4vpeoBWm4s/hqdefault.jpg",
      "views": "Watch on YouTube"
    }
  ],
  "articles": [
    {
      "title": "Understanding 401(k), IRA, Roth IRA, Regular Investing, and HSA in Plain Language",
      "link": "https://iterai.beehiiv.com/p/understanding-401-k-ira-roth-ira-regular-investing-and-hsa-in-plain-language",
      "summary": "Login Sign Up Home Posts Understanding 401(k), IRA, Roth IRA, Regular Investing, and HSA in Plain Language Understanding 401(k), IRA, Roth IRA, Regular Investing, and HSA in Plain Language This guide ...",
      "date": "2026",
      "content": "Login Sign Up Home Posts Understanding 401(k), IRA, Roth IRA, Regular Investing, and HSA in Plain Language Understanding 401(k), IRA, Roth IRA, Regular Investing, and HSA in Plain Language This guide walks through five common buckets in simple terms: 401(k), traditional IRA, Roth IRA, regular taxable investing, and HSA. Nevin Selby Jan 14, 2026 • 8 min read Money set aside for the future can live in different “buckets.” Each bucket has its own rules about taxes, when you can use the money, and how flexible it is. Inside the buckets you often hold the same kinds of investments, such as stock funds, bond funds, or cash. The main difference is how each bucket treats contributions and withdrawals. This guide walks through five common buckets in simple terms: 401(k), traditional IRA, Roth IRA, regular taxable investing, and HSA. The goal is to help you see how they fit together, not to sell any product or push any specific move. Think in containers, not products Before diving into the details, it helps to shift what you focus on. Investments are what you buy, such as funds that hold stocks or bonds. Accounts are containers that hold those investments and apply specific tax and access rules. You could, for example, own the same index fund inside a 401(k), an IRA, a Roth IRA, an HSA, or a regular brokerage account. The fund is the same. What changes is: When you get a tax break, if at all. When you are allowed to take money out without penalties. How gains and income inside the account are taxed over the years. Once you see accounts as containers, it is easier to decide which one each saved dollar should go into. 401(k): workplace retirement container A 401(k) is a retirement account that comes through your employer. It is meant for long term saving for life after you stop working full time. Key points in simple language: Money goes in straight from your paycheck. With a traditional 401(k), contributions usually reduce your taxable income this year. You pay income tax later when you withdraw in retirement. Some employers offer a Roth 401(k) option. With that, contributions are after tax, and qualified withdrawals in retirement are tax free. Many employers add their own money through a match. For example, they may put in a percentage of each dollar you contribute, up to a limit. That extra money is a major benefit. Contribution limits are higher than for IRAs, so you can set aside more each year. Taking money out before retirement age often brings taxes and penalties, aside from certain exceptions. How people often use it: First, to get the full employer match if one is offered. Then, as a main way to build retirement savings while working. Traditional IRA: individual pre tax retirement container An IRA is a retirement account you open on your own, not through a job. “Traditional IRA” refers to the pre tax version. In simple terms: You contribute money you have already earned. Depending on your income and whether you are covered by a plan at work, some or all of your contribution may reduce your taxable income this year. Investments in the account grow without you paying tax on gains each year. You pay income tax later when you withdraw in retirement. Annual contribution limits are lower than for a 401(k). Withdrawals before retirement age often trigger taxes and penalties unless you meet specific exceptions. People turn to a traditional IRA when: They want to save for retirement but do not have a workplace plan. They already contribute to a 401(k) and still want to add more to tax advantaged retirement saving, within the rules. Roth IRA: individual after tax retirement container A Roth IRA is another type of IRA, but it flips the tax timing. In plain language: You contribute money that has already been taxed. Investments grow in the account. If you follow the rules and wait long enough, withdrawals in retirement can be tax free. Contributions, the actual dollars you put in, are often more flexible and may be withdrawn if needed, but the growth has rules. There are income limits that can limit or block direct contributions if you earn above certain thresholds. Many systems do not force you to take money out at a specific age, which gives more control over timing. Why people like Roth IRAs: The idea of tax free retirement withdrawals is appealing. It can be useful if you expect to be in a higher tax bracket later, paying tax now when your rate is lower. The ability to access contributions in a pinch (with care) adds a little psychological comfort, though it is still best to treat it as long term money. Regular taxable investing account: flexible container for many goals A regular brokerage account is not a special retirement account. It is simply a place where you buy and hold investments. Simple traits: There is no direct tax break for contributing. You can invest as much as you like, within your own budget. You can withdraw whenever you choose, while understanding that investment values can move up and down. You pay taxes on dividends, interest, and realized capital gains as they happen, according to your local tax rules. Why it still matters a lot: It is the most flexible container. You can use it for medium term goals such as a house deposit, starting a business, or partial early retirement. It lets you keep investing after you have hit contribution limits in retirement accounts. There are no age rules about when you can access the money. This account is a key part of many plans, even though it lacks special tax features. HSA: health focused container with strong tax features A Health Savings Account, where available, is tied to certain health insurance plans with higher deductibles. It is meant first and foremost for medical expenses, but it has unique tax traits. In many systems: Contributions can reduce taxable income. Money in the HSA can be invested and grow without yearly tax on earnings. Withdrawals for qualified medical expenses are tax free. After a certain age, some non medical withdrawals may be allowed with income tax but without some of the earlier penalties, which makes it somewhat similar to a retirement account for those withdrawals. How people often use an HSA: Short term, as a way to pay for current medical costs using money that got a tax break going in. Long term, some choose to pay current medical bills out of pocket and let the HSA investments grow, then use the account later for health expenses in retirement, which can be significant. Because the rules are specific and mistakes can be costly, it is worth making sure you understand what counts as a qualified medical expense before using an HSA in more advanced ways. How these fit together in a real life order People’s situations differ, but many build their plan in layers. One simple order of thinking is: Short term safety first Before locking money away, build an emergency fund in plain savings so you are not forced to raid long term accounts when something goes wrong. Take advantage of any employer match If your workplace offers a 401(k) match, aim to contribute enough to get that full match. It is one of the clearer “no brainer” returns available. Add individual retirement saving Decide whether a traditional IRA, a Roth IRA, or some mix makes sense for you, based on your income, tax situation, and how you feel about paying taxes now versus later. Use this to deepen your retirement cushion. Use an HSA thoughtfully if you qualify If you have a qualifying health plan and an HSA, consider funding it, at least enough to cover expected medical costs, and possibly more if you want to invest for future health expenses and the rules in your area support that. Invest through a regular brokerage for flexibility For goals that do not fit retirement accounts, or when you have more to invest after filling the key buckets, use a standard investing account. This keeps your options open for midlife choices that do not wait until traditional retirement age. This is not a strict formula, but it illustrates that the accounts are not enemies. They are tools that can work side by side. Putting it into your own context Instead of asking “Which of these is the best,” you might ask: Which containers do I actually have access to right now What does my employer offer and am I using it fully How much flexibility do I need in the next few years How important is it to me to lower taxes now versus later From there, the picture often looks like this: Use workplace and health related plans where they are clearly beneficial. Use IRAs to add depth to retirement saving in a personal way. Use regular investing accounts as your flexible bridge between today and later, filling goals that do not fall neatly into any one category. Viewed this way, 401(k)s, IRAs, Roth IRAs, HSAs, and regular accounts feel less like a confusing list of acronyms and more like a set of shelves. Each shelf has a label and a few rules. Your job is to decide which shelf each saved dollar belongs on, based on what you want your life to look like in the years ahead. Keep Reading Getting Started with Vertex AI Agent Builder: A Beginner’s Guide to Building AI Agents on Google Cloud Step-by-step walkthrough of Vertex AI Agent Builder features, real-world uses, and simple setup instructions for new users Oct 8, 2025 Financial Planning for Real Life The Human Story Behind Modern Digital Advice Nov 26, 2025 Crafting Clear Prompts A Practical Guide to Getting Better Answers from AI Dec 17, 2025 View more IterAI Build. Learn. Grow. Share © 2026 IterAI. Report abuse Privacy policy Terms of use Powered by beehiiv 1",
      "tags": [
        "AI",
        "Finance",
        "Cloud"
      ]
    },
    {
      "title": "“Sleep at Night” Investing: Designing a Plan You Can Emotionally Handle",
      "link": "https://iterai.beehiiv.com/p/sleep-at-night-investing-designing-a-plan-you-can-emotionally-handle",
      "summary": "Login Sign Up Home Posts “Sleep at Night” Investing: Designing a Plan You Can Emotionally Handle “Sleep at Night” Investing: Designing a Plan You Can Emotionally Handle Nevin Selby Jan 7, 2026 • 9 min...",
      "date": "2026",
      "content": "Login Sign Up Home Posts “Sleep at Night” Investing: Designing a Plan You Can Emotionally Handle “Sleep at Night” Investing: Designing a Plan You Can Emotionally Handle Nevin Selby Jan 7, 2026 • 9 min read Investing is not only about charts, statistics, and clever strategies. It is also about feelings. If your plan looks great on paper but keeps you awake at two in the morning, it is not a good plan for you. The goal of “sleep at night” investing is simple. Build an approach that you can live with in real life, during good years and bad ones, without constant worry or panic. Below is a detailed guide that focuses on the emotional side, not just the math. 1. Why your feelings about risk matter as much as returns Most people talk about risk as a number. Volatility. Standard deviation. Historical drawdowns. In reality, risk is also that heavy feeling in your chest when your account balance drops. A plan that ignores emotions often fails in the real world because: Big market drops feel worse than big gains feel good. Fear and stress push people to sell at bad times. Shame and regret can stop people from investing again after they make a mistake. So the aim is not to remove all risk. That is impossible. The aim is to choose a level of risk that lets you stay invested long enough for the plan to work. Ask yourself: What happened the last time you saw a big market drop in the news Did you feel calm, uneasy, or did you want to pull everything out How often do you check your accounts during stressful times Your honest answers matter more than any textbook label of “conservative” or “aggressive.” 2. Matching risk to your real temperament Many people choose an aggressive mix when markets feel calm, then feel overwhelmed in the first real shock. To avoid that, it helps to match risk to how you actually react, not how you wish you reacted. Here are some practical signals to guide you: You might be more conservative than you think if You check your investments many times a day when markets move. You lose sleep when your account drops, even if you do not need the money soon. You often imagine worst-case scenarios. You have gone to cash in the past during a downturn and stayed out for a long time. You might be able to handle more risk if You can watch news of market drops and still stick to your plan. You focus more on long term trends than daily swings. You have a stable job, a good emergency fund, and low high interest debt. You have already been through a rough market and did not panic sell. Neither side is “better.” The point is to accept where you are on this spectrum and choose a mix that respects that. A simple way to adjust: If you felt sick during the last downturn, consider increasing your bond and cash weight a bit and reducing stocks. If you felt fine and wished you had invested more, you might be able to carry a little more equity exposure. Small adjustments that you can live with are better than extreme changes that you later regret. 3. Designing a “sleep at night” allocation Once you have a sense of your emotional risk level, you can design your mix of cash, bonds, and stocks to match. Think in three layers: Safety layer Money that must not fluctuate much because it covers emergencies and near term needs. This usually lives in savings accounts or similar low risk places. Stability layer Investments that move, but less sharply. Typically higher quality bonds or bond funds. Growth layer Stocks or stock funds that drive long term growth but can swing around in the short term. For a calmer investor, the safety and stability layers will be larger. For someone comfortable with more volatility and with a long horizon, the growth layer will be larger. A few guidelines: Make sure your safety layer is big enough that you do not need to touch your growth layer during a crisis. Let your growth layer hold only money that you truly do not need for many years. Accept that a calmer allocation may grow more slowly, but remember that staying invested often matters more than chasing the highest possible return. 4. Preparing yourself before the next market drop The worst time to write your rulebook is in the middle of a storm. It is better to prepare while things are relatively calm. Here are ways to get ready: Learn what “normal” volatility looks like Look up simple, historical facts such as: How often markets have dropped 10 percent in a year. How often bigger drops have happened. How long past recoveries have taken on average. You do not need exact numbers. You just need a sense that drops are not rare freak events. They are part of the journey. Knowing this in advance makes it easier to recognize a downturn as “unpleasant but expected” rather than “the world ending.” Imagine concrete scenarios Ask yourself: How would I feel if my investments fell 20 percent this year on paper What would I do if that happened two years in a row What if the news is full of fear and everyone around me is panicking It can help to write down your answers. This simple exercise makes it more likely you will act according to your plan when those feelings show up for real. Separate your emergency money from your investments When you know that your emergency fund is safe and available, you are less likely to raid your long term investments when markets fall. This separation lowers panic. You know you can pay bills without selling at the worst moment. 5. Decide your rules in advance One of the most powerful things you can do is write simple personal rules and treat them like a contract with yourself. Examples of rules: “I will not sell my long term investments in response to headlines alone.” “I will only change my allocation after a quiet week of thinking and not on the same day I feel afraid.” “I will review my investments twice a year, not every day.” “If markets fall more than 20 percent, I will reread my plan before taking any action.” You can also write: What would make you increase risk. What would make you decrease risk. Which trusted person you might talk to before making big decisions. These are not legal documents. They are guardrails for your future self. When fear or greed shows up, you will already have a map instead of trying to draw one while the car is skidding. 6. A simple “downturn plan” for your future self It helps to have a very clear, step by step playbook for what you will do during a market drop. For example: Pause Give yourself at least a day or two before making any major changes. Strong feelings are not a good guide. Check your real life situation Ask: Has my job changed Has my income changed Have my goals changed Or is it only the market that is noisy Revisit your time horizon If you still do not need the money for many years, remind yourself that drops, while painful, are expected. Review your rules Read your written rules out loud. This may sound simple, but it helps anchor you in your own prior thinking. Take only small, deliberate actions if needed Instead of selling everything, you might: Adjust your mix slightly if it truly no longer matches your risk comfort Pause new contributions for a short time if cash flow is tight, without touching existing investments Focus on your emergency fund if that feels too small Limit information overload Reduce how often you check markets and avoid endless scrolling through fearful news or social media. Too much noise amplifies anxiety and rarely improves decisions. This plan does not remove the discomfort of seeing losses on paper, but it keeps that discomfort from turning into a serious mistake. 7. Use tools carefully to support your calm, not to stir anxiety Technology can make it very easy to watch your portfolio move in real time. This can be helpful or harmful. Some practical choices: Turn off non essential notifications. You do not need a buzz for every tiny movement. Decide how often you will log in. For many long term investors, checking monthly or quarterly is enough. Use simple visuals that show long term trends, not just daily lines. Ask yourself: “Does this app or tool help me feel clearer and calmer Or does it make me want to react all the time” If it is the second, consider changing settings or even switching tools. The right tools for you are the ones that help you follow your plan, not the ones that constantly tempt you to abandon it. 8. Adjust slowly as your life changes A “sleep at night” plan is not frozen forever. Your job, family, health, and goals will change. Your plan should slowly adjust too. Good moments to revisit your plan: A major life event such as marriage, divorce, birth of a child, or serious illness A big change in income or job situation Approaching a goal date, like buying a home or retiring After living through a major market event and noticing how you truly felt When you adjust: Make changes in small steps instead of big jumps. Keep notes on why you changed the plan, so you can look back and learn. Remember that the goal is still the same. To build a plan you can follow without constant fear. Investing that lets you sleep at night does not look the same for everyone. For some, it will mean more bonds and a smoother ride. For others, it will mean accepting more ups and downs because they truly can handle it and have the time. The common thread is honesty with yourself. If you choose a plan that respects your real temperament, prepare for downturns in advance, and decide your rules before emotions run high, you give yourself a better chance to stay invested through both storms and sunshine. That steady, long term participation is what usually makes the difference, much more than any clever trick or prediction. Keep Reading Model Context Protocol: Connecting AI to Real-World Tools and Data MCP is a new open standard designed to help AI applications work seamlessly with the tools and data people use every day. Nov 5, 2025 How I Passed the Google Cloud Professional Machine Learning Engineer Certification A Step-by-Step Guide on passing the PMLE Certification from Google Cloud Sep 24, 2025 The Rise of Generative AI Engineers: Career Opportunities in 2025 This article explores the surge in generative AI engineer opportunities, the skills employers seek, and how different backgrounds can lead to thriving careers in this fast-evolving space. Oct 15, 2025 View more IterAI Build. Learn. Grow. Share © 2026 IterAI. Report abuse Privacy policy Terms of use Powered by beehiiv 0",
      "tags": [
        "AI",
        "Finance",
        "Cloud"
      ]
    },
    {
      "title": "Before You Use AI to Invest, Learn the Basics of Investing",
      "link": "https://iterai.beehiiv.com/p/before-you-use-ai-to-invest-learn-the-basics-of-investing",
      "summary": "Login Sign Up Home Posts Before You Use AI to Invest, Learn the Basics of Investing Before You Use AI to Invest, Learn the Basics of Investing Nevin Selby Dec 31, 2025 • 8 min read Before anyone lets ...",
      "date": "2026",
      "content": "Login Sign Up Home Posts Before You Use AI to Invest, Learn the Basics of Investing Before You Use AI to Invest, Learn the Basics of Investing Nevin Selby Dec 31, 2025 • 8 min read Before anyone lets a tool or “smart” system touch their money, it helps to step back and really understand what investing is. If you know the basics, you can see clearly when a suggestion makes sense and when it does not, no matter how impressive the technology looks. What investing really is Investing is using your money to buy things that can help you reach future goals. You give up some comfort today so that your future self has more options later. It helps to separate three ideas: Saving Putting money somewhere safe, usually in cash accounts. The goal is that the balance is steady and easy to access. Investing Putting money into assets that can grow over time, like stocks or bonds. The value can move up and down, sometimes a lot. Speculating Taking big risks, often in the short term, hoping for big rewards. This might involve frequent trading, complex products, or chasing “hot” tips. Long-term investing lives in the middle. It accepts some risk, but with a plan and a purpose behind it. The goal is not to win a game. The goal is to fund a life. Start with your own life, not the market Before thinking about charts or funds, it is worth asking a few simple questions about yourself. 1. What are you investing for Some common reasons: To be able to stop working one day or reduce hours To buy a home or move to a different city To help children with education To have a cushion so you are not stressed about every bill Write your goals down in clear sentences. For example: “I want to be able to stop working full-time around 45 and still live comfortably.” “I want to save 40,000 for a home down payment in four years.” Clear words make it easier to choose a clear plan. 2. When will you need the money This is your time horizon. If you will need the money in less than three years, it is short-term. Three to ten years is medium term. More than ten years is long term. Short-term money usually belongs in safer places. Long-term money can handle more ups and downs. 3. How much up and down can you handle Even good investments can drop in value for a while. If seeing your account fall by 20 percent would make you lose sleep and want to sell everything, it is better to build a calmer mix from the start. There is no shame in preferring a smoother ride. A slower path you can stick with is better than a “perfect” plan you abandon. The main “buckets” you can invest in Most simple portfolios are built from a few basic building blocks. Cash and cash-like accounts These are: Savings accounts Money market funds Short-term deposits They are: Easy to access Very steady in value Not great at growing faster than inflation over long periods Use them for: Emergency funds Bills and near term plans Money you cannot afford to see drop Bonds Bonds are loans. You lend money to a government or a company. In return, you receive interest, and ideally, your original amount back at the end. They are: Usually less bumpy than stocks Still exposed to risk if the borrower struggles or interest rates move a lot Use them for: Adding stability to a portfolio Goals that are several years away but where you want less bumpiness Reducing overall swings while still earning some return Stocks Stocks represent small pieces of a business. When businesses grow and make profits, the value of their shares can rise. They are: More volatile in the short term Historically strong at growing wealth over long periods Use them for: Long term goals Money you do not need for at least ten years Situations where you accept that some years will feel rough in exchange for higher growth over decades You can own stocks and bonds either one by one, or more simply through funds that hold many at once. Why spreading your money out matters Putting everything into one company, one sector, or one idea can go very wrong. Even good businesses can face surprises. Diversification is the habit of spreading your money across: Several asset types (cash, bonds, stocks) Many companies and sectors Different regions or countries Imagine you are carrying several small baskets instead of a single big one. If you drop one, the others are still fine. In investing terms, one disappointment does not ruin the whole plan. Many people achieve this by using broad funds: A fund that holds hundreds or thousands of stocks A fund that holds many types of bonds This is more about protecting yourself than about being clever. Choosing a mix that fits you Asset allocation is the phrase for “what percentage in each bucket.” A simple way to think about it: If your goal is far away and you can tolerate ups and downs You might choose more in stocks and less in bonds. If your goal is close or you really dislike big swings You might choose more in bonds and cash and less in stocks. Some people in their 30s saving for far off retirement are comfortable with most of their portfolio in stocks. Someone in their 60s getting ready to live off their savings may prefer roughly half in stocks and half in bonds or even less in stocks. What matters is not hitting a magic number. What matters is that you understand your mix and can live with it when markets are rough. Matching accounts to your goals Investing does not happen in a vacuum. It happens inside real accounts with real rules. Different account types can: Reduce or delay taxes Limit when you can withdraw money Offer special benefits for specific uses like retirement or education Simple guidelines: Keep short term money in accounts that are easy to access and safe, even if the interest is not exciting. Put long term investments in accounts that offer tax advantages when possible, if those exist where you live. Avoid touching long term accounts for short term wants, because there may be penalties or long term damage to your plan. You do not need to become a tax expert. You only need to know that account choice is part of the plan, not an afterthought. Putting it together into a starting plan Here is one way to build a first real plan: Secure your base Build an emergency fund for real surprises. Pay down very high interest debt. This step is not glamorous, but it keeps your future investments from constantly getting derailed. Write down your goals What are you saving or investing for Roughly when will you need each bucket of money Pick a simple allocation Decide what portion of your long term money to place in stocks, bonds, and cash. Keep it simple: for example, two or three funds that cover broad areas rather than many tiny pieces. Set up regular contributions Choose an amount you can stick with monthly, even if it is small to begin. Automate transfers right after payday so investing happens before the money is spent elsewhere. Revisit once or twice a year Check whether your mix still matches your age, goals, and feelings about risk. Rebalance if one part has grown much larger than planned. Adjust only when your life changes, not just because headlines are loud. This kind of structure gives you something solid before you layer any tools or “smart” systems on top. Where tools can help after you know the basics Once you understand these fundamentals, technology can be useful in very practical ways: Turning a list of transactions into a clean picture of your spending Showing you how saving a bit more could move your retirement age or home timeline Summarizing long documents from banks or brokers into plain language What tools should not do is replace your judgment about risk, your goals, or your basic plan. If a suggestion clashes with the simple principles above, that is a sign to slow down and ask more questions. At the end of the day, investing is a long conversation between your present self and your future self. Tools can help translate, but you are the one who has to live with the results. Keep Reading Designing Guardrails for AI Financial Advice How to Let Agents Help With Money Without Letting Them Run Wild Dec 10, 2025 AI Agents at Work: How Digital Co‐Workers Are Transforming Cloud Teams in 2025 AI agents are no longer just assistants that fetch information or summarize data. They are now a part of daily cloud operations. Oct 29, 2025 The Rise of Generative AI Engineers: Career Opportunities in 2025 This article explores the surge in generative AI engineer opportunities, the skills employers seek, and how different backgrounds can lead to thriving careers in this fast-evolving space. Oct 15, 2025 View more IterAI Build. Learn. Grow. Share © 2026 IterAI. Report abuse Privacy policy Terms of use Powered by beehiiv 1",
      "tags": [
        "AI",
        "Finance",
        "Cloud"
      ]
    },
    {
      "title": "Agents vs Traditional Automation in Finance",
      "link": "https://iterai.beehiiv.com/p/agents-vs-traditional-automation-in-finance",
      "summary": "Login Sign Up Home Posts Agents vs Traditional Automation in Finance Agents vs Traditional Automation in Finance It is about understanding where simple rules are enough and where real context and judg...",
      "date": "2026",
      "content": "Login Sign Up Home Posts Agents vs Traditional Automation in Finance Agents vs Traditional Automation in Finance It is about understanding where simple rules are enough and where real context and judgment start to matter Nevin Selby Dec 24, 2025 • 7 min read Most financial teams already rely on plenty of automation. Scripts run overnight jobs, tools reconcile accounts, and bots move data between systems. With all that in place, it is fair to ask what value a more flexible, “agent like” system really adds. This is not about replacing everything that works. It is about understanding where simple rules are enough and where real context and judgment start to matter. Below is a detailed walk through of three concrete areas where this difference shows up clearly: expense auditing, portfolio rebalancing, and KYC refresh. Traditional Automation and Agent Style Systems, in Plain Terms Traditional automation is very good at: Following fixed rules Working on clean, structured data Doing the same task the same way every time Typical examples are: A script that flags any expense over a certain amount A job that rebalances a portfolio back to target percentages on a set schedule A process that checks whether the required documents are present for KYC Agent like systems do something different. They aim toward a goal, look at several pieces of context at once, and adjust their steps along the way. In practice that means: Weighing multiple signals instead of one threshold Reading and interpreting text, not just structured fields Asking for clarification or suggesting options instead of giving a single yes or no Deciding when to escalate for a human decision With that lens, the question becomes: where is the extra flexibility actually useful Expense Auditing: Simple Flags vs Context What rules already handle well Many companies already run basic automated checks on expenses. For example: Flag any single meal over a set limit Block claims submitted more than a certain number of days late Reject entries missing a cost center or receipt These checks are perfect for very clear policy lines. They are easy to explain, and they catch obvious issues. Where rules alone struggle Problems start when: Policy depends on role or situation Senior staff may have different limits. A special offsite may have temporary rules. Multiple small expenses form a pattern Several borderline amounts at the same place can matter more together than alone. Descriptions matter “Client dinner with X and Y to discuss contract renewal” is different from “team drinks” even if the amount is the same. Legitimate exceptions are common Travel disruptions, last minute bookings, shared receipts and other real life messiness do not fit cleanly into simple rules. Rules can either miss these cases or create so many flags that the review team starts to ignore them. What a more flexible system adds A more agent like expense checker can: Read text descriptions and receipts to understand the purpose of an expense Compare current claims to a person’s past behavior, to their peers, or to policy for that trip or project Group related transactions into one story rather than looking at each in isolation Write short, clear questions when something is unclear instead of immediately rejecting the claim In practical terms: When an expense clearly violates a rule, a simple automated flag is enough When something lives in a gray area, the system can gather context, ask targeted questions, and prepare a suggested decision for a human reviewer The extra reasoning is not needed for every meal or taxi. It matters for the messy handful that usually eats up most review time. Portfolio Rebalancing: Fixed Rules vs Life Context What scheduled rules already do well Rebalancing is an area where traditional automation is strong. Most systems can: Define a target mix of assets, for example 60 percent stocks and 40 percent bonds Check regularly whether the portfolio has drifted outside a tolerance band Place trades to bring the portfolio back to its target mix For simple, long term portfolios with few constraints, this works very well. Where life complicates the picture Real investors and households rarely fit a perfect model. A pure rule based rebalancer often ignores: Upcoming changes A big bonus, planned home purchase, or known break in income can make it unwise to rebalance right now. Tax impact Realizing gains in a taxable account may create a large bill that outweighs the small benefit of tightening the allocation. Multiple accounts People often hold assets in several accounts with different tax treatments. A single rule does not balance across them gracefully. Shifts in risk tolerance A recent scare, job change, or family event may have changed how much volatility someone can live with. What a more context aware system adds A more agent like rebalancing assistant can: Read and use planner notes or user input about near term goals and changes Look across accounts to decide where trades should happen to minimize tax impact Evaluate whether upcoming cash flows will naturally fix part of the drift Present options with pros and cons instead of quietly trading in the background Suggest waiting, partial moves, or a change in the overall target if the person’s situation has shifted Here too, simple rules remain useful: In tax sheltered accounts with regular contributions and a long horizon For small portfolios where complexity is not worth the added effort Richer reasoning pays off when decisions interact with taxes, life events, and several accounts at once. KYC Refresh: Checklists vs Investigation What checklists already cover Know Your Customer processes can be highly structured. Traditional automation can: Track when reviews are due based on client type and risk category Confirm that identity documents are current Verify that required fields like address, legal name, and ownership percentages are filled Trigger reminders when something is missing or expired For straightforward clients, this covers most of what is required. Where things get messy Challenges arise when: Ownership structures become layered and cross border New public information changes the risk picture Transactions start to look different from what was originally expected Stricter rules apply to certain industries or politically exposed persons In these situations, a simple checklist can say “all documents are present” while missing that the nature of the client’s risk has changed. What a more investigative system adds A more agent like KYC assistant can: Pull information from multiple sources, including unstructured documents and public records Build a clear picture of ownership and control, even across several layers Compare actual transaction patterns with the declared business purpose Highlight inconsistencies and compile them into a human readable summary Suggest a revised risk rating and explain why, while leaving the final decision to a human compliance officer Checklists remain essential for basic completeness. Agents are helpful where judgment, narrative, and pattern spotting across several systems are needed. When Rules Are Enough and When Reasoning Is Worth It A simple way to choose between traditional automation and more flexible workflows is to ask three questions. Are the rules stable, clear, and easy to write down If yes, traditional scripts, jobs, or RPA are usually the most reliable and maintainable solution. Does the task depend heavily on context, text, or human judgment If the work involves reading explanations, weighing tradeoffs, or interpreting patterns over time, an agent style system can add real value. Is human interaction part of the job When you need to ask clarifying questions, present options, or explain tradeoffs in plain language, it helps to have something that can operate more like a collaborator than a one way filter. The most robust financial setups will not choose one approach over the other. They will: Keep simple, rule based automation where it shines Add reasoning layers where context and nuance really matter Let people define the rules of the game, make the hard calls, and carry responsibility for outcomes In that kind of design, agents are not there to replace existing systems. They are there to sit in the messy middle, where real world complexity makes rigid rules strain and humans are tired of doing the same interpretive work over and over. Keep Reading Financial Planning for Real Life The Human Story Behind Modern Digital Advice Nov 26, 2025 Understanding 401(k), IRA, Roth IRA, Regular Investing, and HSA in Plain Language This guide walks through five common buckets in simple terms: 401(k), traditional IRA, Roth IRA, regular taxable investing, and HSA. Jan 14, 2026 Getting Started with Vertex AI Agent Builder: A Beginner’s Guide to Building AI Agents on Google Cloud Step-by-step walkthrough of Vertex AI Agent Builder features, real-world uses, and simple setup instructions for new users Oct 8, 2025 View more IterAI Build. Learn. Grow. Share © 2026 IterAI. Report abuse Privacy policy Terms of use Powered by beehiiv 1",
      "tags": [
        "AI",
        "Finance",
        "Cloud"
      ]
    },
    {
      "title": "Crafting Clear Prompts",
      "link": "https://iterai.beehiiv.com/p/crafting-clear-prompts",
      "summary": "Login Sign Up Home Posts Crafting Clear Prompts Crafting Clear Prompts A Practical Guide to Getting Better Answers from AI Nevin Selby Dec 17, 2025 • 7 min read Prompt engineering sounds technical, bu...",
      "date": "2026",
      "content": "Login Sign Up Home Posts Crafting Clear Prompts Crafting Clear Prompts A Practical Guide to Getting Better Answers from AI Nevin Selby Dec 17, 2025 • 7 min read Prompt engineering sounds technical, but at its core, it is just the practice of asking better questions. You are trying to describe what you want in a way that a system can follow consistently, without you hovering over its shoulder every time. Done well, it feels less like “talking to a robot” and more like giving clear instructions to a smart but very literal coworker. Below is a detailed, human take on how to approach it, with a focus on real workflows rather than buzzwords. Start With the Outcome, Not the Prompt A lot of people start by asking, “How do I phrase this?” when the better starting point is “What does a good answer look like?” Before writing anything: Picture the final result on your screen. Is it a three-part article, a JSON object, a short email reply, a list of bullet points, or a step-by-step plan? Note who it is for. A beginner, an engineer, a client, an internal stakeholder. Different audiences call for different tones and depth. Decide what is out of bounds. For example: no hype, no brand mentions, no claims that sound like legal or tax advice. Once you know that, you can write the prompt backwards from the outcome. If you skip this and jump straight into wording, you end up tweaking sentences instead of fixing the real problem. Treat Prompts Like a Brief, Not a Slogan Good prompts look more like a creative brief or a spec than a single clever phrase. Clarity beats cleverness every time. A simple structure that works well: Role Describe who the system is pretending to be. “You are a personal finance writer who explains things in plain language.” Task State what you want in one sentence. “Write a detailed article about building an emergency fund.” Context Give just enough background to anchor the task. “Reader has variable income and some credit card debt, feels anxious about money, and wants concrete steps, not theory.” Requirements List your rules in bullets, not a long paragraph. For example: Use clear, everyday language. No references to AI or how you generated this. No promotion or brand names. Include what to do, how to do it, and why it matters. Format Explain how you want the answer shaped. “Use headings, 3–5 sections, and short paragraphs. No conclusion section.” This takes a bit longer to write up front, but it saves you a lot of back and forth later. Say What to Avoid Just as Clearly as What to Include If you have used these systems for a while, you already know certain patterns you never want to see again. Common ones: Self-talk like “As an AI language model.” Overly grand claims such as “revolutionary,” “unleash,” or “game‑changing.” Generic fluff like “In today’s fast‑paced world”. You can head this off directly: “Do not mention AI, models, or how you generated this.” “Avoid marketing phrases like ‘revolutionary’ or ‘cutting edge.’” “Skip generic introductions. Get to the point in the first two sentences.” Negative instructions like these act as simple guardrails. They are especially important if you write about money, health, or other sensitive topics. Break Big Jobs Into Smaller Conversations Trying to do everything in one monster prompt almost always leads to disappointment. It is usually better to move step by step. For example, if you want a long, detailed article: Ask for ideas or angles first. “Give me five possible angles for an article on X.” Then ask for an outline for the angle you like. “Draft a detailed outline for angle number three.” Then generate the article in sections. “Write the introduction and first section following this outline, same tone and constraints as before.” You can do something similar inside a single prompt by saying: “First, outline the structure you will use in short bullets. Then, write the full text following that outline.” The key idea is to make the system think about structure before it starts filling in sentences. Provide Small, Concrete Examples When Style Matters If you care a lot about tone, it helps to show a short sample that feels “right.” For instance, paste a short paragraph you wrote, then say: “Match this style: Direct, calm, and practical. No buzzwords, no drama. Uses specific, everyday examples. Now write about [topic] in the same style but with completely new wording.” The sample acts like a tuning fork. You are not asking it to copy the content, just the feel and rhythm. Be Honest About Constraints Like Length and Audience If you want something truly detailed, say that plainly and point to the tradeoff. For example: “Aim for depth over brevity. It is fine if this runs long as long as each section adds something useful.” “Assume the reader is smart but not a specialist. Explain jargon the first time you use it.” If you prefer a tight answer: “Keep this to around 600–800 words. If you have to choose, focus on practical steps over background.” This kind of instruction helps the system decide what to leave out, which is often more important than what to include. Design Prompts for Real Workflows, Not Just One‑Off Questions In your own work, you may be using these systems inside tools and processes, not just chat windows. In those cases, think of prompts as contracts. For each step in a workflow, ask: What exact input will this step receive What exact output does the next step need Then shape the prompt around that. Example for a multi-step financial workflow: Step 1: Classify the user’s request. Prompt: “Given this text, label it as one of [budgeting, debt, investing, taxes, other]. Return only the label.” Step 2: Decide if the request is safe. Prompt: “Given the label and original text, say whether this is general education or requires a human advisor. Return ‘educational’ or ‘needs human review’ and one short sentence why.” Step 3: Draft educational content only if safe. Prompt: “If the previous step says ‘educational,’ write a practical explanation and steps. Follow these tone and safety rules…” Each prompt is narrow and focused, which usually leads to more reliable behavior than a single mega prompt trying to handle everything. Iterate as You Would With Code Prompt engineering benefits from the same mindset as debugging or refactoring. A simple loop: Write a first version of the prompt. Test it on a handful of different inputs, including ones you expect to be tricky. Look for patterns in what goes wrong. Maybe it ignores a rule, maybe the tone drifts, maybe it forgets a section. Adjust the prompt to fix that pattern, not everything at once. Repeat until the failures are rare or at least predictable. Keep old versions somewhere. It is useful to see how you got from a messy first attempt to a stable “house style” prompt you can reuse. Keep a Personal Library of Snippets Over time, you will discover small pieces of instruction that work well and that you use again and again, such as: A tone block for human, grounded writing. A safety block for financial topics. A formatting block for your preferred heading and paragraph style. Save these snippets. Then, when you craft a new prompt, you can assemble it from pieces you already trust instead of starting from an empty box. Prompt engineering is not magic, and it is not only for technical people. It boils down to describing what you want in a way that is specific, structured, and honest about constraints. The better you get at that, the more these systems start to feel like a natural extension of your own thinking instead of a mysterious black box. Keep Reading Designing Guardrails for AI Financial Advice How to Let Agents Help With Money Without Letting Them Run Wild Dec 10, 2025 Practical Financial Planning Detailed Steps You Can Actually Follow. The goal is to show you exactly what to do, how to do it, and why each step matters. Dec 3, 2025 AI Agents at Work: How Digital Co‐Workers Are Transforming Cloud Teams in 2025 AI agents are no longer just assistants that fetch information or summarize data. They are now a part of daily cloud operations. Oct 29, 2025 View more IterAI Build. Learn. Grow. Share © 2026 IterAI. Report abuse Privacy policy Terms of use Powered by beehiiv 1",
      "tags": [
        "AI",
        "Finance",
        "Cloud"
      ]
    }
  ],
  "publications": [
    {
      "title": "An efficient stock price prediction mechanism using multivariate sequential LSTM autoencoder",
      "summary": "N Selby, A Taparia",
      "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=h7tbBssAAAAJ&citation_for_view=h7tbBssAAAAJ:u5HHmVD_uO8C"
    },
    {
      "title": "An Efficient Stock Price Prediction Mechanism Using Multivariate Sequential LSTM Autoencoder",
      "summary": "G RML, N Selby, A Taparia",
      "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=h7tbBssAAAAJ&citation_for_view=h7tbBssAAAAJ:d1gkVwhDpl0C"
    },
    {
      "title": "Multi-sequential Neural Network Models for Stock Price Forecasting",
      "summary": "JV Sheba Elizabeth Thomas, Rubell Marion Lincy George, Aditya Taparia",
      "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=h7tbBssAAAAJ&citation_for_view=h7tbBssAAAAJ:9yKSN-GCB0IC"
    },
    {
      "title": "Advantage Actor-Critic Reinforcement Learning with Technical Indicators for Stock Trading Decisions",
      "summary": "S Sagar, V Narayanan, D Binu, N Selby, SE Thomas",
      "link": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=h7tbBssAAAAJ&citation_for_view=h7tbBssAAAAJ:u-x6o8ySG0sC"
    }
  ],
  "githubRepos": [
    {
      "name": "AlgorithmicTrader",
      "html_url": "https://github.com/NevinSelby/AlgorithmicTrader",
      "description": null,
      "language": "TypeScript",
      "stargazers_count": 0,
      "updated_at": "Nov 6, 2025"
    },
    {
      "name": "nevinselby.github.io",
      "html_url": "https://github.com/NevinSelby/nevinselby.github.io",
      "description": null,
      "language": "CSS",
      "stargazers_count": 0,
      "updated_at": "Oct 12, 2025"
    },
    {
      "name": "JekyllPortfolio",
      "html_url": "https://github.com/NevinSelby/JekyllPortfolio",
      "description": "Github Pages template for academic personal websites, forked from mmistakes/minimal-mistakes",
      "language": null,
      "stargazers_count": 0,
      "updated_at": "Aug 6, 2025"
    },
    {
      "name": "NevinSelby",
      "html_url": "https://github.com/NevinSelby/NevinSelby",
      "description": null,
      "language": null,
      "stargazers_count": 1,
      "updated_at": "Aug 1, 2025"
    },
    {
      "name": "AI-Powered-Git-Activity-Monitor",
      "html_url": "https://github.com/NevinSelby/AI-Powered-Git-Activity-Monitor",
      "description": null,
      "language": "JavaScript",
      "stargazers_count": 0,
      "updated_at": "Jul 27, 2025"
    },
    {
      "name": "JobCrawler",
      "html_url": "https://github.com/NevinSelby/JobCrawler",
      "description": null,
      "language": "Python",
      "stargazers_count": 0,
      "updated_at": "Jul 9, 2025"
    },
    {
      "name": "Etsy-Web-App",
      "html_url": "https://github.com/NevinSelby/Etsy-Web-App",
      "description": null,
      "language": "Python",
      "stargazers_count": 0,
      "updated_at": "Jul 9, 2025"
    },
    {
      "name": "MLOps-WeatherApp",
      "html_url": "https://github.com/NevinSelby/MLOps-WeatherApp",
      "description": null,
      "language": "Python",
      "stargazers_count": 1,
      "updated_at": "Jun 21, 2025"
    },
    {
      "name": "AutoML-ify",
      "html_url": "https://github.com/NevinSelby/AutoML-ify",
      "description": "AutoML-ify is a powerful and intuitive tool that automates the entire machine learning workflow, from data upload to model deployment and monitoring. It's designed for speed and efficiency, allowing you to focus on deriving insights rather than on repetitive coding tasks.",
      "language": "Python",
      "stargazers_count": 1,
      "updated_at": "Jun 21, 2025"
    },
    {
      "name": "WhatsApp-Chat-Analysis",
      "html_url": "https://github.com/NevinSelby/WhatsApp-Chat-Analysis",
      "description": "Detailed analysis of your WhatsApp chats",
      "language": "Python",
      "stargazers_count": 1,
      "updated_at": "May 20, 2025"
    },
    {
      "name": "Fetch_ML_Apprentice_Task",
      "html_url": "https://github.com/NevinSelby/Fetch_ML_Apprentice_Task",
      "description": "BERT-based multi-task learning system that analyzes Starbuck's reviews by simultaneously classifying review attributes (food, service, etc) and sentiment (positive/negative/neutral). Features shared neural network layers for efficiency with task-specific classification heads.",
      "language": "Python",
      "stargazers_count": 0,
      "updated_at": "Apr 30, 2025"
    },
    {
      "name": "ai-data-science-team",
      "html_url": "https://github.com/NevinSelby/ai-data-science-team",
      "description": "An AI-powered data science team of agents to help you perform common data science tasks 10X faster.",
      "language": "Python",
      "stargazers_count": 0,
      "updated_at": "Mar 19, 2025"
    },
    {
      "name": "MovieRecommendationSystem",
      "html_url": "https://github.com/NevinSelby/MovieRecommendationSystem",
      "description": null,
      "language": "Jupyter Notebook",
      "stargazers_count": 0,
      "updated_at": "Mar 8, 2025"
    },
    {
      "name": "Covid19-Tracker",
      "html_url": "https://github.com/NevinSelby/Covid19-Tracker",
      "description": "react.js app that trackers daily status of covid'19 around the globe. ",
      "language": null,
      "stargazers_count": 0,
      "updated_at": "Mar 2, 2025"
    },
    {
      "name": "CS760",
      "html_url": "https://github.com/NevinSelby/CS760",
      "description": "CS 760 Machine Learning assignments",
      "language": null,
      "stargazers_count": 0,
      "updated_at": "Feb 12, 2025"
    },
    {
      "name": "CS744",
      "html_url": "https://github.com/NevinSelby/CS744",
      "description": "This repository consists the code for the work done as part of CS 744: Big Data Systems class offered by Prof Shivaram Venkataraman at UW-Madison during the Spring 2024 semester.",
      "language": null,
      "stargazers_count": 0,
      "updated_at": "Jun 26, 2024"
    },
    {
      "name": "Portfolio",
      "html_url": "https://github.com/NevinSelby/Portfolio",
      "description": null,
      "language": "CSS",
      "stargazers_count": 0,
      "updated_at": "Jan 20, 2024"
    },
    {
      "name": "Fetch_Task",
      "html_url": "https://github.com/NevinSelby/Fetch_Task",
      "description": null,
      "language": "Python",
      "stargazers_count": 0,
      "updated_at": "Oct 1, 2023"
    },
    {
      "name": "AutoML",
      "html_url": "https://github.com/NevinSelby/AutoML",
      "description": null,
      "language": "Python",
      "stargazers_count": 0,
      "updated_at": "Jan 1, 2023"
    },
    {
      "name": "Sven-Bo",
      "html_url": "https://github.com/NevinSelby/Sven-Bo",
      "description": null,
      "language": null,
      "stargazers_count": 0,
      "updated_at": "Dec 1, 2022"
    },
    {
      "name": "relataly-public-python-tutorials",
      "html_url": "https://github.com/NevinSelby/relataly-public-python-tutorials",
      "description": "Beginner-friendly collection of Python notebooks for various use cases of machine learning, deep learning, and analytics. For each notebook there is a separate tutorial on the relataly.com blog.",
      "language": null,
      "stargazers_count": 0,
      "updated_at": "Oct 11, 2022"
    },
    {
      "name": "Invisibility-Cloak",
      "html_url": "https://github.com/NevinSelby/Invisibility-Cloak",
      "description": "Invisibility-Cloak made using OpenCV, Computer Vision",
      "language": "Python",
      "stargazers_count": 0,
      "updated_at": "Mar 21, 2022"
    },
    {
      "name": "Are-you-a-heart-patient",
      "html_url": "https://github.com/NevinSelby/Are-you-a-heart-patient",
      "description": "Website to test whether you are at risk from heart disease or not!",
      "language": "Jupyter Notebook",
      "stargazers_count": 0,
      "updated_at": "Mar 18, 2022"
    },
    {
      "name": "Planogram",
      "html_url": "https://github.com/NevinSelby/Planogram",
      "description": null,
      "language": "JavaScript",
      "stargazers_count": 0,
      "updated_at": "Mar 18, 2022"
    },
    {
      "name": "HandwrittenDigitRecognition",
      "html_url": "https://github.com/NevinSelby/HandwrittenDigitRecognition",
      "description": null,
      "language": "Jupyter Notebook",
      "stargazers_count": 0,
      "updated_at": "Feb 16, 2022"
    },
    {
      "name": "E-Voting-Using-Blockchain",
      "html_url": "https://github.com/NevinSelby/E-Voting-Using-Blockchain",
      "description": null,
      "language": null,
      "stargazers_count": 0,
      "updated_at": "Nov 1, 2021"
    },
    {
      "name": "Ad_Scraper",
      "html_url": "https://github.com/NevinSelby/Ad_Scraper",
      "description": "Scraping Ads from websites and identifying the content and logo in them",
      "language": "Jupyter Notebook",
      "stargazers_count": 0,
      "updated_at": "Oct 14, 2021"
    },
    {
      "name": "GEMWebsiteScraper",
      "html_url": "https://github.com/NevinSelby/GEMWebsiteScraper",
      "description": null,
      "language": "Python",
      "stargazers_count": 0,
      "updated_at": "Oct 12, 2021"
    },
    {
      "name": "hacktoberfest",
      "html_url": "https://github.com/NevinSelby/hacktoberfest",
      "description": "Participate in Hacktoberfest by contributing to any Open Source project on GitHub! Here is a starter project for first time contributors. #hacktoberfest",
      "language": "HTML",
      "stargazers_count": 0,
      "updated_at": "Oct 3, 2021"
    },
    {
      "name": "Smart-Plant",
      "html_url": "https://github.com/NevinSelby/Smart-Plant",
      "description": "Making plants smarter.",
      "language": null,
      "stargazers_count": 0,
      "updated_at": "Oct 2, 2021"
    }
  ]
}